from collections import Counter
import numpy as np
import torch
from torch import nn
import torch.nn.functional as F
import torch.optim as optim
from torch.utils.data import Dataset, DataLoader
from tqdm import tqdm, tqdm_notebook
import gluonnlp as nlp
import copy


class BERTDatasetForTest(Dataset):
    def __init__(self, dataset, bert_tokenizer, max_len,
                pad, pair):
        transform = nlp.data.BERTSentenceTransform(
            bert_tokenizer, max_seq_length=max_len, pad=pad, pair=pair)
        
        # texts = dataset["sentence"].tolist()
        texts = dataset
        # labels = dataset["Emotion"].tolist()

        self.sentences = [transform([text]) for text in texts]
        # self.labels = [np.int32(emotion2label[label]) for label in labels]

    def __getitem__(self, i):
        return (self.sentences[i])

    def __len__(self):
        return (len(self.sentences))

# classifier structure
class BERTClassifier(nn.Module):
    def __init__(self,
                bert,
                hidden_size = 768,
                num_classes = 5,
                dr_rate = None,
                params = None):
        super(BERTClassifier, self).__init__()
        self.bert = bert
        self.dr_rate = dr_rate
                
        self.classifier = nn.Linear(hidden_size , num_classes)
        if dr_rate:
            self.dropout = nn.Dropout(p=dr_rate)
    
    def gen_attention_mask(self, token_ids, valid_length):
        attention_mask = torch.zeros_like(token_ids)
        for i, v in enumerate(valid_length):
            attention_mask[i][:v] = 1
        return attention_mask.float()

    def forward(self, token_ids, valid_length, segment_ids):
        attention_mask = self.gen_attention_mask(token_ids, valid_length)
        
        _, pooler = self.bert(input_ids = token_ids, token_type_ids = segment_ids.long(), attention_mask = attention_mask.float().to(token_ids.device))
        if self.dr_rate:
            out = self.dropout(pooler)
        return self.classifier(out)
    
def get_label_probability(result, label2emotion):
  # result : tensor
    ret_dict = {emotion : 0 for emotion in list(label2emotion.values())}

    result = result.tolist()
    num_results = len(result)
    key_list = list(Counter(result).keys())
    emotion_list = list(label2emotion[key] for key in key_list)

    counted_value_list = list(Counter(result).values())
    prob_value_list = list(counted_value/num_results for counted_value in counted_value_list)

    for emotion, prob_value in zip(emotion_list, prob_value_list):
        ret_dict[emotion] = prob_value
    # print(ret_dict)
#   ret_dict = {emotion_list[i] : prob_value_list[i] for i in range(len(key_list))}

    return ret_dict


statistics = {
    "gender" : {
        "male" : 0.715879002,
        "female" : 0.284120998
    },
    "age" : {
        10 : 0.021595768,
        20 : 0.094644539,
        30 : 0.138705703,
        40 : 0.187549822,
        50 : 0.205594608,
        60 : 0.147474455,
        70 : 0.117399812,
        80 : 0.08645554,
    },
    "job" : {
        "전문가" : 0,
        "기술공 및 준전문가" : 0,
        "농업,임업 및 어업 숙련종사자" : 0.025847785,
        "장치,기계조작 및 조립 종사자" : 0.029161604,
        "기능원 및 관련 기능 종사자" : 0.033359107,
        "관리자" : 0.041422733,
        "사무 종사자" : 0.062631172,
        "전문가 및 관련 종사자" : 0.067380979,
        "기타" : 0.07301447,
        "단순노무 종사자" : 0.076217828,
        "서비스 및 판매 종사자" : 0.134541036,
        "무직, 가사, 학생" : 0.456423285,
    },
    "regidences" : {
        "세종특별자치시" : {
            "total" : 0.046656946,
            "세종특별자치시" : 1,
            },
        "서울특별시" : {
            "total" : 0.046865236,
            "서초구" : 0.027070064,
            "동작구" : 0.031670205,
            "용산구" : 0.032377919,
            "양천구" : 0.032554848,
            "송파구" : 0.033616419,
            "성동구" : 0.033793347,
            "광진구" : 0.033970276,
            "은평구" : 0.035208776,
            "마포구" : 0.035739561,
            "중구" : 0.036270347,
            "구로구" : 0.037154989,
            "동대문구" : 0.040516631,
            "영등포구" : 0.04069356,
            "강북구" : 0.041047417,
            "노원구" : 0.042108988,
            "도봉구" : 0.042639774,
            "강서구" : 0.042816702,
            "관악구" : 0.043701345,
            "강남구" : 0.04423213,
            "성북구" : 0.04547063,
            "서대문구" : 0.046178344,
            "강동구" : 0.046178344,
            "종로구" : 0.047062987,
            "중랑구" : 0.051663128,
            "금천구" : 0.05626327,
            },
        "광주광역시" : {
            "total" : 0.049781296,
            "광산구" : 0.168026101,
            "남구" : 0.192495922,
            "서구" : 0.194942904,
            "북구" : 0.212071778,
            "동구" : 0.232463295,
            },
        "경기도" : {
            "total" : 0.052905645,
            "양주군" : 0,
            "여주군" : 0,
            "화성군" : 0,
            "광주군" : 0,
            "포천군" : 0,
            "파주시" : 0.023361757,
            "고양시" : 0.023595374,
            "군포시" : 0.023828992,
            "하남시" : 0.025464315,
            "의왕시" : 0.026165168,
            "안양시" : 0.026632403,
            "용인시" : 0.026749212,
            "김포시" : 0.027333255,
            "광명시" : 0.027450064,
            "성남시" : 0.027800491,
            "남양주시" : 0.028034108,
            "화성시" : 0.028034108,
            "오산시" : 0.028384535,
            "과천시" : 0.028501343,
            "수원시" : 0.029435814,
            "이천시" : 0.029552622,
            "부천시" : 0.031538372,
            "구리시" : 0.03165518,
            "시흥시" : 0.031888798,
            "의정부시" : 0.032940077,
            "평택시" : 0.033290503,
            "광주시" : 0.033524121,
            "안성시" : 0.034692209,
            "여주시" : 0.034925826,
            "안산시" : 0.036210723,
            "가평군" : 0.037729237,
            "양주시" : 0.040766266,
            "동두천시" : 0.041233501,
            "양평군" : 0.044504147,
            "포천시" : 0.051279056,
            "연천군" : 0.053498423,
            },
        "전라남도" : {
            "total" : 0.052905645,
            "곡성군" : 0.023377943,
            "신안군" : 0.025241403,
            "완도군" : 0.026766051,
            "강진군" : 0.02862951,
            "담양군" : 0.032864645,
            "순천시" : 0.034050483,
            "화순군" : 0.035066915,
            "여수시" : 0.037946807,
            "광양시" : 0.039132644,
            "장성군" : 0.040996104,
            "함평군" : 0.041334914,
            "고흥군" : 0.041673725,
            "나주시" : 0.041843131,
            "보성군" : 0.048788751,
            "목포시" : 0.049466373,
            "해남군" : 0.050482805,
            "영광군" : 0.053870913,
            "구례군" : 0.057089615,
            "무안군" : 0.058444859,
            "영암군" : 0.062510588,
            "진도군" : 0.082669829,
            "장흥군" : 0.087751991,
            },
        "인천광역시" : {
            "total" : 0.053947094,
            "남구" : 0,
            "옹진군" : 0.064587973,
            "연수구" : 0.099331849,
            "계양구" : 0.102004454,
            "동구" : 0.104231626,
            "남동구" : 0.106458797,
            "서구" : 0.114922049,
            "부평구" : 0.131403118,
            "강화군" : 0.13674833,
            "중구" : 0.140311804,
            },
        "경상남도" : {
            "total" : 0.058321183,
            "합천군" : 0.039564787,
            "창녕군" : 0.047675569,
            "고성군" : 0.049060336,
            "진주시" : 0.049851632,
            "밀양시" : 0.050840752,
            "통합창원시" : 0.051829871,
            "함안군" : 0.054005935,
            "사천시" : 0.05479723,
            "하동군" : 0.054995054,
            "함양군" : 0.054995054,
            "김해시" : 0.056181998,
            "거창군" : 0.057566766,
            "의령군" : 0.057962413,
            "남해군" : 0.059149357,
            "양산시" : 0.060731949,
            "산청군" : 0.061523244,
            "거제시" : 0.067062315,
            "통영시" : 0.072205737,
            },
        "울산광역시" : {
            "total" : 0.058737763,
            "북구" : 0.125718391,
            "동구" : 0.200431034,
            "울주군" : 0.21408046,
            "남구" : 0.218390805,
            "중구" : 0.24137931,
            },
        "대구광역시" : {
            "total" : 0.059779213,
            "수성구" : 0.10360547,
            "북구" : 0.106506424,
            "달성군" : 0.113137174,
            "달서구" : 0.119767924,
            "동구" : 0.128470783,
            "서구" : 0.133029424,
            "중구" : 0.134687111,
            "남구" : 0.16079569,
            },
        "대전광역시" : {
            "total" : 0.059779213,
            "유성구" : 0.151232512,
            "서구" : 0.175216522,
            "대덕구" : 0.205862758,
            "중구" : 0.216522318,
            "동구" : 0.251165889,
            },
        "경상북도" : {
            "total" : 0.061237242,
            "울릉군" : 0.028167116,
            "군위군" : 0.028436658,
            "영덕군" : 0.02884097,
            "칠곡군" : 0.029919137,
            "청송군" : 0.031940701,
            "안동시" : 0.032749326,
            "구미시" : 0.032884097,
            "문경시" : 0.033962264,
            "성주군" : 0.036792453,
            "포항시" : 0.037061995,
            "경주시" : 0.037601078,
            "경산시" : 0.039892183,
            "영주시" : 0.043530997,
            "청도군" : 0.047439353,
            "영천시" : 0.047843666,
            "의성군" : 0.049056604,
            "봉화군" : 0.050269542,
            "김천시" : 0.050943396,
            "울진군" : 0.051886792,
            "상주시" : 0.054043127,
            "고령군" : 0.054043127,
            "예천군" : 0.05754717,
            "영양군" : 0.095148248,
            },
        "부산광역시" : {
            "total" : 0.062695272,
            "남구" : 0.040236928,
            "강서구" : 0.045547386,
            "동래구" : 0.052900327,
            "금정구" : 0.054738562,
            "수영구" : 0.055147059,
            "동구" : 0.059640523,
            "해운대구" : 0.061683007,
            "연제구" : 0.062295752,
            "북구" : 0.066380719,
            "부산진구" : 0.067197712,
            "기장군" : 0.068423203,
            "사하구" : 0.068627451,
            "사상구" : 0.069240196,
            "서구" : 0.074346405,
            "중구" : 0.074550654,
            "영도구" : 0.079044118,
            },
        "전라북도" : {
            "total" : 0.062903562,
            "전주시" : 0.05474934,
            "군산시" : 0.072779244,
            "익산시" : 0.073878628,
            "정읍시" : 0.069700967,
            "남원시" : 0.075417766,
            "김제시" : 0.070800352,
            "완주군" : 0.07585752,
            "진안군" : 0.060026385,
            "무주군" : 0.05408971,
            "장수군" : 0.125769569,
            "임실군" : 0.060026385,
            "순창군" : 0.061345646,
            "고창군" : 0.059146878,
            "부안군" : 0.086411609,
            },
        "충청북도" : {
            "total" : 0.064778171,
            "청주시" : 0,
            "청원군" : 0,
            "증평군" : 0.056818182,
            "통합청주시" : 0.070031712,
            "진천군" : 0.07346723,
            "옥천군" : 0.077959831,
            "단양군" : 0.080073996,
            "보은군" : 0.088002114,
            "제천시" : 0.09064482,
            "음성군" : 0.095137421,
            "영동군" : 0.108086681,
            "충주시" : 0.109936575,
            "괴산군" : 0.149841438,
            },
        "제주특별자치도" : {
            "total" : 0.066027911,
            "제주시" : 0.505564388,
            "서귀포시" : 0.494435612,
            },
        "강원도" : {
            "total" : 0.06936055,
            "삼척시" : 0.028955224,
            "고성군" : 0.032537313,
            "인제군" : 0.03761194,
            "영월군" : 0.042238806,
            "춘천시" : 0.043880597,
            "원주시" : 0.045074627,
            "강릉시" : 0.045223881,
            "태백시" : 0.048208955,
            "철원군" : 0.049104478,
            "동해시" : 0.049701493,
            "양구군" : 0.052089552,
            "홍천군" : 0.058358209,
            "속초시" : 0.058955224,
            "정선군" : 0.073134328,
            "횡성군" : 0.074179104,
            "평창군" : 0.078208955,
            "화천군" : 0.084179104,
            "양양군" : 0.098358209,
            },
        "충청남도" : {
            "total" : 0.073318059,
            "연기군" : 0,
            "당진군" : 0,
            "계룡시" : 0.037056738,
            "천안시" : 0.053546099,
            "아산시" : 0.054078014,
            "금산군" : 0.054255319,
            "논산시" : 0.055496454,
            "당진시" : 0.062765957,
            "부여군" : 0.063652482,
            "보령시" : 0.070390071,
            "홍성군" : 0.070921986,
            "서천군" : 0.073758865,
            "공주시" : 0.078546099,
            "태안군" : 0.079432624,
            "예산군" : 0.080673759,
            "서산시" : 0.081737589,
            "청양군" : 0.083687943,
            },
    },
}
